# Week 6 IBM data science Database and SQL (Honors)

In [1]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa

Collecting sqlalchemy==1.3.9
  Using cached SQLAlchemy-1.3.9-cp37-cp37m-win_amd64.whl
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.23
    Uninstalling SQLAlchemy-1.3.23:

WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
    WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
    WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
    WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
    WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
    WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
ERROR: Could not install packages due to an OSError: [WinError 5] Access is denied: 'c:\\programdata\\anaconda3\\lib\\site-packages\\sqlalchemy-1.3.23.dist-info\\direct_url.json'
Consider using the `--user` option or check the permissions.

WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)

Requirement already satisfied: ibm_db_sa in c:\programdata\anaconda3\lib\site-packages (0.3.7)
Requirement already satisfied: ibm-db>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ibm_db_sa) (3.0.4)
Requirement already satisfied: sqlalchemy>=0.7.3 in c:\programdata\anaconda3\lib\site-packages (from ibm_db_sa) (1.3.23)

WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -qlalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lalchemy (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -egex (c:\programdata\anaconda3\lib\site-packages)

In [1]:
%load_ext sql

In [2]:
%sql ibm_db_sa://mgr61801:aG6rnocuLnVjRZCo@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb?security=SSL

'Connected: mgr61801@bludb'

In [4]:
%sql select * from testtable1

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'prada', 'waghya', 'jigar'),
 (2, 'sanket1', 'prada1', 'waghya1', 'jigar1'),
 (3, '7IMF7', '8NMTC', 'XCL66', 'KZUD3'),
 (4, 'GY4T8', 'PC4SI', 'XRTSK', 'Y0O4J'),
 (5, '5DNIQ', 'FKIZT', 'Q63GC', 'CS4MF'),
 (6, 'Q0SCT', 'BBLTU', 'WFD5R', 'PJHQU'),
 (7, '31ULI', '66BKA', 'M3ESZ', 'XKFD5')]

In [11]:
%%sql
CREATE VIEW testview (column1, column2, column3) as select serial_number, name, name2 
from testtable1
where serial_number < 5;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [23]:
%%sql
create view empinfo2 (empID, firstName, lastName, Address, jobId, ManagerId, DepId)
as select emp_id, f_name, l_name, address, job_id, manager_id, dep_id
from employees
where manager_id = '30002';

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [14]:
%sql select * from empinfo

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('E1001    ', 'John', 'Thomas', '5631 Rice, OakPark,IL', '100      ', '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '980 Berry ln, Elgin,IL', '200      ', '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '291 Springs, Gary,IL', '300      ', '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '511 Aurora Av, Aurora,IL', '400      ', '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '216 Oak Tree, Geneva,IL', '500      ', '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '111 Green Pl, Elgin,IL', '600      ', '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '100 Rose Pl, Gary,IL', '650      ', '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '145 Berry Ln, Naperville,IL', '660      ', '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '120 Fall Creek, Gary,IL', '234      ', '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '111 Britany Springs,Elgin,IL', '220      ', '30004    ', '5        ')]

In [15]:
%sql select * from testview

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'waghya'),
 (2, 'sanket1', 'waghya1'),
 (3, '7IMF7', 'XCL66'),
 (4, 'GY4T8', 'XRTSK')]

In [26]:
%sql select * from empinfo2

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('E1002    ', 'Alice', 'James', '980 Berry ln, Elgin,IL', '200      ', '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '291 Springs, Gary,IL', '300      ', '30002    ', '5        ')]

In [28]:
%%sql
create view testview2 
as select serial_number, name, name2
from testtable1

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [30]:
%sql select * from testview2

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'sanket', 'waghya'),
 (2, 'sanket1', 'waghya1'),
 (3, '7IMF7', 'XCL66'),
 (4, 'GY4T8', 'XRTSK'),
 (5, '5DNIQ', 'Q63GC'),
 (6, 'Q0SCT', 'WFD5R'),
 (7, '31ULI', 'M3ESZ')]

In [31]:
%%sql
create view empsalary 
as select emp_id, f_name, l_name, b_date, sex, salary
from employees;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [32]:
%sql select * from empsalary limit 10

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('E1001    ', 'John', 'Thomas', datetime.date(1976, 1, 9), 'M', Decimal('100000.00')),
 ('E1002    ', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', Decimal('80000.00')),
 ('E1003    ', 'Steve', 'Wells', datetime.date(1980, 8, 10), 'M', Decimal('50000.00')),
 ('E1004    ', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', Decimal('60000.00')),
 ('E1005    ', 'Ahmed', 'Hussain', datetime.date(1981, 1, 4), 'M', Decimal('70000.00')),
 ('E1006    ', 'Nancy', 'Allen', datetime.date(1978, 2, 6), 'F', Decimal('90000.00')),
 ('E1007    ', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', Decimal('65000.00')),
 ('E1008    ', 'Bharath', 'Gupta', datetime.date(1985, 5, 6), 'M', Decimal('65000.00')),
 ('E1009    ', 'Andrea', 'Jones', datetime.date(1990, 7, 9), 'F', Decimal('70000.00')),
 ('E1010    ', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', Decimal('70000.00'))]

In [41]:
%%sql
create or replace view empsalary2 as
select emp_id, f_name, l_name, b_date, sex, job_title, min_salary, max_salary
from employees, jobs /* testing comment */
where employees.job_id = jobs.job_ident;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [46]:
%sql select * from empsalary2

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('E1001    ', 'John', 'Thomas', datetime.date(1976, 1, 9), 'M', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('E1002    ', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', 'Sr.Software Dev', Decimal('60000.00'), Decimal('80000.00')),
 ('E1003    ', 'Steve', 'Wells', datetime.date(1980, 8, 10), 'M', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('E1004    ', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('E1005    ', 'Ahmed', 'Hussain', datetime.date(1981, 1, 4), 'M', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('E1006    ', 'Nancy', 'Allen', datetime.date(1978, 2, 6), 'F', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('E1007    ', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1008    ', 'Bharath', 'Gupta', datetime.date(1985, 5, 6), 'M', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1009    ', 'Andrea', 'Jones', datetime.date(1990, 7, 9), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('E1010    ', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))]

In [43]:
%sql drop view empsalay

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [45]:
%sql drop view empsalary

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0204N  "MGR61801.EMPSALARY" is an undefined name.  SQLSTATE=42704\r SQLCODE=-204
[SQL: drop view empsalary]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [77]:
%%sql
-- Drop the table in case it exists

DROP TABLE PETSALE;

-- Create the table

CREATE TABLE PETSALE (
	ID INTEGER NOT NULL,
	ANIMAL VARCHAR(20),
	SALEPRICE DECIMAL(6,2),
	SALEDATE DATE,
	QUANTITY INTEGER,
	PRIMARY KEY (ID)
	);

-- Insert sample data into the table

INSERT INTO PETSALE VALUES
(1,'Cat',450.09,'2018-05-29',9),
(2,'Dog',666.66,'2018-06-01',3),
(3,'Parrot',50.00,'2018-06-04',2),
(4,'Hamster',60.60,'2018-06-11',6),
(5,'Goldfish',48.48,'2018-06-14',24);

-- Retrieve all records from the table

SELECT * FROM PETSALE;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.
Done.
5 rows affected.
Done.

[(1, 'Cat', Decimal('450.09'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

In [78]:
%sql select * from petsale;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'Cat', Decimal('450.09'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

In [81]:
%%sql
--#SET TERMINATOR as @

CREATE PROCEDURE RETRIEVE_ALL     -- Name of this stored procedure routine

LANGUAGE SQL                        -- Language used in this routine 
READS SQL DATA                      -- This routine will only read data from the table

DYNAMIC RESULT SETS 1               -- Maximum possible number of result-sets to be returned to the caller query

BEGIN 

    DECLARE C1 CURSOR               -- CURSOR C1 will handle the result-set by retrieving records row by row from the table
    WITH RETURN FOR                 -- This routine will return retrieved records as a result-set to the caller query
    
    SELECT * FROM PETSALE;          -- Query to retrieve all the records from the table
    
    OPEN C1;                        -- Keeping the CURSOR C1 open so that result-set can be returned to the caller query

END

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [82]:
%%sql 
call retrieve_all

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: The last call to execute did not produce any result set.
(Background on this error at: http://sqlalche.me/e/13/f405)

In [84]:
%%sql
--#SET TERMINATOR 
@
CREATE PROCEDURE UPDATE_SALEPRICE1 ( 
    IN Animal_ID INTEGER, IN Animal_Health VARCHAR(5) )     -- ( { IN/OUT type } { parameter-name } { data-type }, ... )

LANGUAGE SQL                                                -- Language used in this routine
MODIFIES SQL DATA                                           -- This routine will only write/modify data in the table

BEGIN 

    IF Animal_Health = 'BAD' THEN                           -- Start of conditional statement
        UPDATE PETSALE
        SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.25)
        WHERE ID = Animal_ID;
    
    ELSEIF Animal_Health = 'WORSE' THEN
        UPDATE PETSALE
        SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.5)
        WHERE ID = Animal_ID;
        
    ELSE
        UPDATE PETSALE
        SET SALEPRICE = SALEPRICE
        WHERE ID = Animal_ID;

    END IF;                                                 -- End of conditional statement
    
END
@                                                         -- Routine termination character

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [85]:
%%sql
call update_saleprice1(3, 'BAD');

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
(ibm_db_dbi.OperationalError) ibm_db_dbi::OperationalError: Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL1646N  A routine failed because the fenced user ID cannot access required files in the sqllib directory or other instance or database directories.\r SQLCODE=-1646
[SQL: call update_saleprice1(3, 'BAD');]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [86]:
%%sql
CALL RETRIEVE_ALL;

CALL UPDATE_SALEPRICE(1, 'WORSE');        -- Caller query

CALL RETRIEVE_ALL;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.
Done.
Done.
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: The last call to execute did not produce any result set.
(Background on this error at: http://sqlalche.me/e/13/f405)

In [87]:
%sql select * from petsale;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[(1, 'Cat', Decimal('84.39'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

In [89]:
%sql select * from BankAccounts;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0204N  "MGR61801.BANKACCOUNTS" is an undefined name.  SQLSTATE=42704\r SQLCODE=-204
[SQL: select * from BankAccounts;]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [91]:
%%sql

-- Create the table

CREATE TABLE BankAccounts (
    AccountNumber VARCHAR(5) NOT NULL,
    AccountName VARCHAR(25) NOT NULL,
    Balance DECIMAL(8,2) CHECK(Balance>=0) NOT NULL,
    PRIMARY KEY (AccountNumber)
    );

-- Insert sample data into the table
    
INSERT INTO BankAccounts VALUES
('B001','Rose',300),
('B002','James',1345),
('B003','Shoe Shop',124200),
('B004','Corner Shop',76000);

-- Retrieve all records from the table

SELECT * FROM BankAccounts;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.
4 rows affected.
Done.

[('B001', 'Rose', Decimal('300.00')),
 ('B002', 'James', Decimal('1345.00')),
 ('B003', 'Shoe Shop', Decimal('124200.00')),
 ('B004', 'Corner Shop', Decimal('76000.00'))]

In [94]:
%%sql
-- Drop the table in case it exists

--DROP TABLE ShoeShop;

-- Create the table

CREATE TABLE ShoeShop (
    Product VARCHAR(25) NOT NULL,
    Stock INTEGER NOT NULL,
    Price DECIMAL(8,2) CHECK(Price>0) NOT NULL,
    PRIMARY KEY (Product)
    );

-- Insert sample data into the table
    
INSERT INTO ShoeShop VALUES
('Boots',11,200),
('High heels',8,600),
('Brogues',10,150),
('Trainers',14,300);

-- Retrieve all records from the table

SELECT * FROM ShoeShop;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.
4 rows affected.
Done.

[('Boots', 11, Decimal('200.00')),
 ('High heels', 8, Decimal('600.00')),
 ('Brogues', 10, Decimal('150.00')),
 ('Trainers', 14, Decimal('300.00'))]

In [97]:
%%sql
--#SET TERMINATOR

CREATE PROCEDURE TRANSACTION_ROSE                           -- Name of this stored procedure routine

LANGUAGE SQL                                                -- Language used in this routine 
MODIFIES SQL DATA                                           -- This routine will only write/modify data in the table

BEGIN

        DECLARE SQLCODE INTEGER DEFAULT 0;                  -- Host variable SQLCODE declared and assigned 0
        DECLARE retcode INTEGER DEFAULT 0;                  -- Local variable retcode with declared and assigned 0
        DECLARE CONTINUE HANDLER FOR SQLEXCEPTION           -- Handler tell the routine what to do when an error or warning occurs
        SET retcode = SQLCODE;                              -- Value of SQLCODE assigned to local variable retcode
        
        UPDATE BankAccounts
        SET Balance = Balance-200
        WHERE AccountName = 'Rose';
        
        UPDATE BankAccounts
        SET Balance = Balance+200
        WHERE AccountName = 'Shoe Shop';
        
        UPDATE ShoeShop
        SET Stock = Stock-1
        WHERE Product = 'Boots';
        
        UPDATE BankAccounts
        SET Balance = Balance-300
        WHERE AccountName = 'Rose';

        
        IF retcode < 0 THEN                                  --  SQLCODE returns negative value for error, zero for success, positive value for warning
            ROLLBACK WORK;
        
        ELSE
            COMMIT WORK;
        
        END IF;
        
END
                                                           -- Routine termination character

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [101]:
%sql CALL TRANSACTION_ROSE;  -- Caller query

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [115]:
%sql select * from BankAccounts;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('B001', 'Rose', Decimal('300.00')),
 ('B002', 'James', Decimal('0.00')),
 ('B003', 'Shoe Shop', Decimal('125545.00')),
 ('B004', 'Corner Shop', Decimal('76000.00'))]

In [116]:
%sql select * from shoeshop;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('Boots', 10, Decimal('200.00')),
 ('High heels', 8, Decimal('600.00')),
 ('Brogues', 9, Decimal('150.00')),
 ('Trainers', 14, Decimal('300.00'))]

In [117]:
%%sql
--delete procedure if exist
drop procedure transaction_james

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [118]:
%%sql
CREATE PROCEDURE TRANSACTION_JAMES
LANGUAGE SQL
MODIFIES SQL DATA
BEGIN
    DECLARE SQLCODE INTEGER DEFAULT 0;
    DECLARE retcode INTEGER DEFAULT 0;
    DECLARE CONTINUE HANDLER FOR SQLEXCEPTION
    SET retcode = SQLCODE;
    
    UPDATE BankAccounts
    SET Balance = Balance - 1200
    WHERE AccountName = 'James';
    
    UPDATE BankAccounts
    SET Balance = Balance + 1200
    WHERE AccountName = 'Shoe Shop';
    
    UPDATE ShoeShop
    SET Stock = Stock -4
    WHERE Product = 'Boots';
    
    UPDATE BankAccounts
    SET Balance = Balance - 145
    WHERE AccountName = 'James';
    
    UPDATE BankAccounts
    SET Balance = Balance + 145
    WHERE AccountName = 'Shoe Shop';
    
    UPDATE ShoeShop
    SET Stock = Stock -1
    WHERE Product = 'Brogues';
        
    IF RETCODE < 0 THEN
        ROLLBACK WORK;
    ELSE
        COMMIT WORK;
    END IF;
END

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [113]:
%sql call transaction_james

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [119]:
%sql select * from BankAccounts;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('B001', 'Rose', Decimal('300.00')),
 ('B002', 'James', Decimal('0.00')),
 ('B003', 'Shoe Shop', Decimal('125545.00')),
 ('B004', 'Corner Shop', Decimal('76000.00'))]

In [120]:
%sql select * from Shoeshop

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('Boots', 10, Decimal('200.00')),
 ('High heels', 8, Decimal('600.00')),
 ('Brogues', 9, Decimal('150.00')),
 ('Trainers', 14, Decimal('300.00'))]

In [126]:
%sql call transaction_james;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [127]:
%sql select * from Shoeshop

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('Boots', 6, Decimal('200.00')),
 ('High heels', 8, Decimal('600.00')),
 ('Brogues', 8, Decimal('150.00')),
 ('Trainers', 14, Decimal('300.00'))]

In [128]:
%sql select * from bankaccounts;

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[('B001', 'Rose', Decimal('300.00')),
 ('B002', 'James', Decimal('655.00')),
 ('B003', 'Shoe Shop', Decimal('126890.00')),
 ('B004', 'Corner Shop', Decimal('76000.00'))]

In [125]:
%%sql 
update bankaccounts
set balance = 2000
where accountname = 'James';

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
1 rows affected.

[]

In [130]:
%%sql
create view testview4
as select accountnumber, accountname
from bankaccounts
where balance < 1000

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [3]:
%%sql
--#SET TERMINATOR 
@
CREATE OR REPLACE PROCEDURE UPDATE_LEADERS_SCORE (IN in_School_ID INTEGER, IN in_Leader_Score INTEGER)
  LANGUAGE SQL
  
	BEGIN 

		UPDATE chicago_public_schools
		SET Leaders_Score = in_Leader_Score
			WHERE School_ID = in_School_ID;
			
		IF in_Leader_Score > 0 AND in_Leader_Score < 20 THEN
	      	UPDATE chicago_public_schools
				SET Leaders_Icon = 'Very Weak';
	    ELSEIF in_Leader_Score < 40 THEN
	       	UPDATE chicago_public_schools
				SET Leaders_Icon = 'Weak';	
	    ELSEIF in_Leader_Score < 60 THEN
	       	UPDATE chicago_public_schools
				SET Leaders_Icon = 'Average';
	    ELSEIF in_Leader_Score < 80 THEN
	       	UPDATE chicago_public_schools
				SET Leaders_Icon = 'Strong';
	    ELSEIF in_Leader_Score < 100 THEN
	       	UPDATE CHICAGO_PUBLIC_SCHOOLS
				SET Leaders_Icon = 'Very Strong';
	   	END IF;
	   	END
        @

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb
Done.

[]

In [6]:
%sql call update_leaders_score(610281,56);

 * ibm_db_sa://mgr61801:***@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/bludb

DataError: (ibm_db_dbi.DataError) ibm_db_dbi::DataError: Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0433N  Value "Average" is too long.  SQLSTATE=22001\r SQLCODE=-433
[SQL: call update_leaders_score(610281,56);]
(Background on this error at: http://sqlalche.me/e/13/9h9h)